#+OPTIONS: toc:nil
#+OPTIONS: num:nil

** To host locally

build a simple executable to serve static assets locally

#+begin_src bash
go build
#+end_src

#+RESULTS:

To run, execute the following. The server will launch in a separate
window.

#+begin_src elisp
(async-shell-command "./static-website-literate-demo")
#+end_src

#+RESULTS:
: #<window 407 on *Async Shell Command*>

